happychriss/ESP32-A1S-sound-machine/src/hello-world/sdkconfig.defaults
# Target: ESP32 (not S3)
CONFIG_IDF_TARGET="esp32"

# Serial output on UART0 (GPIO1 TX, GPIO3 RX) at 115200
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
